In [11]:
import pandas as pd
import numpy as np

In [12]:
s = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9])
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [16]:
dates = pd.date_range("20130101", periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.605300  0.213711  0.619706 -0.826734
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-06 -0.793368  0.936607 -0.611259  0.045780

In [18]:
a = np.random.randn(6, 4)
a

array([[-0.38036812, -0.41335895,  0.51879357, -0.29603055],
       [-2.29480736,  1.14731319,  0.14267412, -0.18745288],
       [-1.0315994 ,  1.22769255, -0.21093376, -0.29357928],
       [-0.11124948, -0.5448766 ,  0.40112951, -0.5933622 ],
       [ 1.07729723,  2.22009923, -0.75556147, -1.71659616],
       [-1.56074929,  1.61392348, -0.01722127,  0.49754069]])

In [19]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [21]:
df.head()

                   A         B         C         D
2013-01-01 -0.605300  0.213711  0.619706 -0.826734
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-05  0.253434  0.944191 -0.621201  0.016780

In [22]:
df.tail()

                   A         B         C         D
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-06 -0.793368  0.936607 -0.611259  0.045780

In [23]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
df.to_numpy

<bound method DataFrame.to_numpy of                    A         B         C         D
2013-01-01 -0.605300  0.213711  0.619706 -0.826734
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-06 -0.793368  0.936607 -0.611259  0.045780>

In [25]:
df

                   A         B         C         D
2013-01-01 -0.605300  0.213711  0.619706 -0.826734
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-06 -0.793368  0.936607 -0.611259  0.045780

In [26]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.605300   -0.658456   -0.716398   -1.133913    0.253434   -0.793368
B    0.213711   -0.193651    1.620067   -0.408014    0.944191    0.936607
C    0.619706   -0.725729    0.607626   -0.620237   -0.621201   -0.611259
D   -0.826734   -2.053923    0.855760   -0.325450    0.016780    0.045780

In [27]:
df

                   A         B         C         D
2013-01-01 -0.605300  0.213711  0.619706 -0.826734
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-06 -0.793368  0.936607 -0.611259  0.045780

In [28]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.609000  0.518819 -0.225182 -0.381298
std    0.462020  0.778198  0.651138  0.986953
min   -1.133913 -0.408014 -0.725729 -2.053923
25%   -0.774125 -0.091810 -0.620960 -0.701413
50%   -0.687427  0.575159 -0.615748 -0.154335
75%   -0.618589  0.942295  0.302904  0.038530
max    0.253434  1.620067  0.619706  0.855760

In [29]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2013-01-06 -0.793368  0.936607 -0.611259  0.045780
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-01 -0.605300  0.213711  0.619706 -0.826734

In [30]:
df.sort_values(by="B",ascending=False)

                   A         B         C         D
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-06 -0.793368  0.936607 -0.611259  0.045780
2013-01-01 -0.605300  0.213711  0.619706 -0.826734
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450

In [31]:
df2.loc[1:3,["A","B"]]

     A          B
1  1.0 2013-01-02
2  1.0 2013-01-02
3  1.0 2013-01-02

In [32]:
df.loc["2013-01-01", ["A"]]

A   -0.6053
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.iloc[0:3,2:4]

                   C         D
2013-01-01  0.619706 -0.826734
2013-01-02 -0.725729 -2.053923
2013-01-03  0.607626  0.855760

In [34]:
df[df["A"]>1]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [35]:
df = df.iloc[0:6,:]

In [36]:
df

                   A         B         C         D
2013-01-01 -0.605300  0.213711  0.619706 -0.826734
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923
2013-01-03 -0.716398  1.620067  0.607626  0.855760
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450
2013-01-05  0.253434  0.944191 -0.621201  0.016780
2013-01-06 -0.793368  0.936607 -0.611259  0.045780

In [37]:
df["E"] = ["one","two","three","four","five","six"]

/var/folders/6x/wgh739ls5z333f70z53v36600000gn/T/ipykernel_4195/319696895.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["E"] = ["one","two","three","four","five","six"]

In [38]:
df

                   A         B         C         D      E
2013-01-01 -0.605300  0.213711  0.619706 -0.826734    one
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923    two
2013-01-03 -0.716398  1.620067  0.607626  0.855760  three
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450   four
2013-01-05  0.253434  0.944191 -0.621201  0.016780   five
2013-01-06 -0.793368  0.936607 -0.611259  0.045780    six

In [39]:
df[df["E"].isin(["one","two","three"])]

                   A         B         C         D      E
2013-01-01 -0.605300  0.213711  0.619706 -0.826734    one
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923    two
2013-01-03 -0.716398  1.620067  0.607626  0.855760  three

In [40]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [41]:
df.at[dates[0], "A"] = 0

In [42]:
df

                   A         B         C         D      E
2013-01-01  0.000000  0.213711  0.619706 -0.826734    one
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923    two
2013-01-03 -0.716398  1.620067  0.607626  0.855760  three
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450   four
2013-01-05  0.253434  0.944191 -0.621201  0.016780   five
2013-01-06 -0.793368  0.936607 -0.611259  0.045780    six

In [43]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [44]:
df1.loc[dates[0] : dates[1], "E"] = None

In [45]:
df1

                   A         B         C         D      E      E
2013-01-01  0.000000  0.213711  0.619706 -0.826734   None   None
2013-01-02 -0.658456 -0.193651 -0.725729 -2.053923   None   None
2013-01-03 -0.716398  1.620067  0.607626  0.855760  three  three
2013-01-04 -1.133913 -0.408014 -0.620237 -0.325450   four   four

In [48]:
df1.isna()

                A      B      C      D      E      E
2013-01-01  False  False  False  False   True   True
2013-01-02  False  False  False  False   True   True
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

In [52]:
df1.dropna(how="any")

                   A         B         C        D      E      E
2013-01-03 -0.716398  1.620067  0.607626  0.85576  three  three
2013-01-04 -1.133913 -0.408014 -0.620237 -0.32545   four   four

In [1]:
df1.fillna(value=10000)

NameError: name 'df1' is not defined